Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSent_reg.h
/** \brief 4D4, Input and Output Control Register 15 */
#define SENT_CH15_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF00034D4u)
/** Alias (User Manual Name) for SENT_CH15_IOCR.
* To use register names with standard convension, please use SENT_CH15_IOCR.
*/
#define SENT_IOCR15 (SENT_CH15_IOCR)

/** \brief 4D8, SPC Control Register 15 */
#define SENT_CH15_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF00034D8u)
/** Alias (User Manual Name) for SENT_CH15_SCR.
* To use register names with standard convension, please use SENT_CH15_SCR.
*/
#define SENT_SCR15 (SENT_CH15_SCR)

/** \brief 4DC, Receive Data View Register 15 */
#define SENT_CH15_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF00034DCu)
/** Alias (User Manual Name) for SENT_CH15_VIEW.
* To use register names with standard convension, please use SENT_CH15_VIEW.
*/
#define SENT_VIEW15 (SENT_CH15_VIEW)

/** \brief 4E0, Interrupt Status Register 15 */
#define SENT_CH15_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00034E0u)
/** Alias (User Manual Name) for SENT_CH15_INTSTAT.
* To use register names with standard convension, please use SENT_CH15_INTSTAT.
*/
#define SENT_INTSTAT15 (SENT_CH15_INTSTAT)

/** \brief 4E4, Interrupt Set Register 15 */
#define SENT_CH15_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00034E4u)
/** Alias (User Manual Name) for SENT_CH15_INTSET.
* To use register names with standard convension, please use SENT_CH15_INTSET.
*/
#define SENT_INTSET15 (SENT_CH15_INTSET)

/** \brief 4E8, Interrupt Clear Register 15 */
#define SENT_CH15_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00034E8u)
/** Alias (User Manual Name) for SENT_CH15_INTCLR.
* To use register names with standard convension, please use SENT_CH15_INTCLR.
*/
#define SENT_INTCLR15 (SENT_CH15_INTCLR)

/** \brief 4EC, Interrupt Enable Register 15 */
#define SENT_CH15_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00034ECu)
/** Alias (User Manual Name) for SENT_CH15_INTEN.
* To use register names with standard convension, please use SENT_CH15_INTEN.
*/
#define SENT_INTEN15 (SENT_CH15_INTEN)

/** \brief 4F0, Interrupt Node Pointer Register 15 */
#define SENT_CH15_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00034F0u)
/** Alias (User Manual Name) for SENT_CH15_INP.
* To use register names with standard convension, please use SENT_CH15_INP.
*/
#define SENT_INP15 (SENT_CH15_INP)

/** \brief 4F4, Watch Dog Timer Register 15 */
#define SENT_CH15_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00034F4u)
/** Alias (User Manual Name) for SENT_CH15_WDT.
* To use register names with standard convension, please use SENT_CH15_WDT.
*/
#define SENT_WDT15 (SENT_CH15_WDT)

/** \brief 500, Channel Pre Divider Register 16 */
#define SENT_CH16_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003500u)
/** Alias (User Manual Name) for SENT_CH16_CPDR.
* To use register names with standard convension, please use SENT_CH16_CPDR.
*/
#define SENT_CPDR16 (SENT_CH16_CPDR)

/** \brief 504, Channel Fractional Divider Register 16 */
#define SENT_CH16_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003504u)
/** Alias (User Manual Name) for SENT_CH16_CFDR.
* To use register names with standard convension, please use SENT_CH16_CFDR.
*/
#define SENT_CFDR16 (SENT_CH16_CFDR)

/** \brief 508, Receiver Control Register 16 */
#define SENT_CH16_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003508u)
/** Alias (User Manual Name) for SENT_CH16_RCR.
* To use register names with standard convension, please use SENT_CH16_RCR.
*/
#define SENT_RCR16 (SENT_CH16_RCR)

/** \brief 50C, Receive Status Register 16 */
#define SENT_CH16_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000350Cu)
/** Alias (User Manual Name) for SENT_CH16_RSR.
* To use register names with standard convension, please use SENT_CH16_RSR.
*/
#define SENT_RSR16 (SENT_CH16_RSR)

/** \brief 510, Serial Data and Status Register 16 */
#define SENT_CH16_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003510u)
/** Alias (User Manual Name) for SENT_CH16_SDS.
* To use register names with standard convension, please use SENT_CH16_SDS.
*/
#define SENT_SDS16 (SENT_CH16_SDS)

/** \brief 514, Input and Output Control Register 16 */
#define SENT_CH16_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003514u)
/** Alias (User Manual Name) for SENT_CH16_IOCR.
* To use register names with standard convension, please use SENT_CH16_IOCR.
*/
#define SENT_IOCR16 (SENT_CH16_IOCR)

/** \brief 518, SPC Control Register 16 */
#define SENT_CH16_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003518u)
/** Alias (User Manual Name) for SENT_CH16_SCR.
* To use register names with standard convension, please use SENT_CH16_SCR.
*/
#define SENT_SCR16 (SENT_CH16_SCR)

/** \brief 51C, Receive Data View Register 16 */
#define SENT_CH16_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000351Cu)
/** Alias (User Manual Name) for SENT_CH16_VIEW.
* To use register names with standard convension, please use SENT_CH16_VIEW.
*/
#define SENT_VIEW16 (SENT_CH16_VIEW)

/** \brief 520, Interrupt Status Register 16 */
#define SENT_CH16_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003520u)
/** Alias (User Manual Name) for SENT_CH16_INTSTAT.
* To use register names with standard convension, please use SENT_CH16_INTSTAT.
*/
#define SENT_INTSTAT16 (SENT_CH16_INTSTAT)

/** \brief 524, Interrupt Set Register 16 */
#define SENT_CH16_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003524u)
/** Alias (User Manual Name) for SENT_CH16_INTSET.
* To use register names with standard convension, please use SENT_CH16_INTSET.
*/
#define SENT_INTSET16 (SENT_CH16_INTSET)

/** \brief 528, Interrupt Clear Register 16 */
#define SENT_CH16_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003528u)
/** Alias (User Manual Name) for SENT_CH16_INTCLR.
* To use register names with standard convension, please use SENT_CH16_INTCLR.
*/
#define SENT_INTCLR16 (SENT_CH16_INTCLR)

/** \brief 52C, Interrupt Enable Register 16 */
#define SENT_CH16_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000352Cu)
/** Alias (User Manual Name) for SENT_CH16_INTEN.
* To use register names with standard convension, please use SENT_CH16_INTEN.
*/
#define SENT_INTEN16 (SENT_CH16_INTEN)

/** \brief 530, Interrupt Node Pointer Register 16 */
#define SENT_CH16_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003530u)
/** Alias (User Manual Name) for SENT_CH16_INP.
* To use register names with standard convension, please use SENT_CH16_INP.
*/
#define SENT_INP16 (SENT_CH16_INP)

/** \brief 534, Watch Dog Timer Register 16 */
#define SENT_CH16_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003534u)
/** Alias (User Manual Name) for SENT_CH16_WDT.
* To use register names with standard convension, please use SENT_CH16_WDT.
*/
#define SENT_WDT16 (SENT_CH16_WDT)

/** \brief 540, Channel Pre Divider Register 17 */
#define SENT_CH17_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003540u)
/** Alias (User Manual Name) for SENT_CH17_CPDR.
* To use register names with standard convension, please use SENT_CH17_CPDR.
*/
#define SENT_CPDR17 (SENT_CH17_CPDR)

/** \brief 544, Channel Fractional Divider Register 17 */
#define SENT_CH17_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003544u)
/** Alias (User Manual Name) for SENT_CH17_CFDR.
* To use register names with standard convension, please use SENT_CH17_CFDR.
*/
#define SENT_CFDR17 (SENT_CH17_CFDR)

/** \brief 548, Receiver Control Register 17 */
#define SENT_CH17_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003548u)
/** Alias (User Manual Name) for SENT_CH17_RCR.
* To use register names with standard convension, please use SENT_CH17_RCR.
*/
#define SENT_RCR17 (SENT_CH17_RCR)

