Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSent_reg.h
/** \brief 54C, Receive Status Register 17 */
#define SENT_CH17_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000354Cu)
/** Alias (User Manual Name) for SENT_CH17_RSR.
* To use register names with standard convension, please use SENT_CH17_RSR.
*/
#define SENT_RSR17 (SENT_CH17_RSR)

/** \brief 550, Serial Data and Status Register 17 */
#define SENT_CH17_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003550u)
/** Alias (User Manual Name) for SENT_CH17_SDS.
* To use register names with standard convension, please use SENT_CH17_SDS.
*/
#define SENT_SDS17 (SENT_CH17_SDS)

/** \brief 554, Input and Output Control Register 17 */
#define SENT_CH17_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003554u)
/** Alias (User Manual Name) for SENT_CH17_IOCR.
* To use register names with standard convension, please use SENT_CH17_IOCR.
*/
#define SENT_IOCR17 (SENT_CH17_IOCR)

/** \brief 558, SPC Control Register 17 */
#define SENT_CH17_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003558u)
/** Alias (User Manual Name) for SENT_CH17_SCR.
* To use register names with standard convension, please use SENT_CH17_SCR.
*/
#define SENT_SCR17 (SENT_CH17_SCR)

/** \brief 55C, Receive Data View Register 17 */
#define SENT_CH17_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000355Cu)
/** Alias (User Manual Name) for SENT_CH17_VIEW.
* To use register names with standard convension, please use SENT_CH17_VIEW.
*/
#define SENT_VIEW17 (SENT_CH17_VIEW)

/** \brief 560, Interrupt Status Register 17 */
#define SENT_CH17_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003560u)
/** Alias (User Manual Name) for SENT_CH17_INTSTAT.
* To use register names with standard convension, please use SENT_CH17_INTSTAT.
*/
#define SENT_INTSTAT17 (SENT_CH17_INTSTAT)

/** \brief 564, Interrupt Set Register 17 */
#define SENT_CH17_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003564u)
/** Alias (User Manual Name) for SENT_CH17_INTSET.
* To use register names with standard convension, please use SENT_CH17_INTSET.
*/
#define SENT_INTSET17 (SENT_CH17_INTSET)

/** \brief 568, Interrupt Clear Register 17 */
#define SENT_CH17_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003568u)
/** Alias (User Manual Name) for SENT_CH17_INTCLR.
* To use register names with standard convension, please use SENT_CH17_INTCLR.
*/
#define SENT_INTCLR17 (SENT_CH17_INTCLR)

/** \brief 56C, Interrupt Enable Register 17 */
#define SENT_CH17_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000356Cu)
/** Alias (User Manual Name) for SENT_CH17_INTEN.
* To use register names with standard convension, please use SENT_CH17_INTEN.
*/
#define SENT_INTEN17 (SENT_CH17_INTEN)

/** \brief 570, Interrupt Node Pointer Register 17 */
#define SENT_CH17_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003570u)
/** Alias (User Manual Name) for SENT_CH17_INP.
* To use register names with standard convension, please use SENT_CH17_INP.
*/
#define SENT_INP17 (SENT_CH17_INP)

/** \brief 574, Watch Dog Timer Register 17 */
#define SENT_CH17_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003574u)
/** Alias (User Manual Name) for SENT_CH17_WDT.
* To use register names with standard convension, please use SENT_CH17_WDT.
*/
#define SENT_WDT17 (SENT_CH17_WDT)

/** \brief 580, Channel Pre Divider Register 18 */
#define SENT_CH18_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003580u)
/** Alias (User Manual Name) for SENT_CH18_CPDR.
* To use register names with standard convension, please use SENT_CH18_CPDR.
*/
#define SENT_CPDR18 (SENT_CH18_CPDR)

/** \brief 584, Channel Fractional Divider Register 18 */
#define SENT_CH18_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003584u)
/** Alias (User Manual Name) for SENT_CH18_CFDR.
* To use register names with standard convension, please use SENT_CH18_CFDR.
*/
#define SENT_CFDR18 (SENT_CH18_CFDR)

/** \brief 588, Receiver Control Register 18 */
#define SENT_CH18_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003588u)
/** Alias (User Manual Name) for SENT_CH18_RCR.
* To use register names with standard convension, please use SENT_CH18_RCR.
*/
#define SENT_RCR18 (SENT_CH18_RCR)

/** \brief 58C, Receive Status Register 18 */
#define SENT_CH18_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000358Cu)
/** Alias (User Manual Name) for SENT_CH18_RSR.
* To use register names with standard convension, please use SENT_CH18_RSR.
*/
#define SENT_RSR18 (SENT_CH18_RSR)

/** \brief 590, Serial Data and Status Register 18 */
#define SENT_CH18_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003590u)
/** Alias (User Manual Name) for SENT_CH18_SDS.
* To use register names with standard convension, please use SENT_CH18_SDS.
*/
#define SENT_SDS18 (SENT_CH18_SDS)

/** \brief 594, Input and Output Control Register 18 */
#define SENT_CH18_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003594u)
/** Alias (User Manual Name) for SENT_CH18_IOCR.
* To use register names with standard convension, please use SENT_CH18_IOCR.
*/
#define SENT_IOCR18 (SENT_CH18_IOCR)

/** \brief 598, SPC Control Register 18 */
#define SENT_CH18_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003598u)
/** Alias (User Manual Name) for SENT_CH18_SCR.
* To use register names with standard convension, please use SENT_CH18_SCR.
*/
#define SENT_SCR18 (SENT_CH18_SCR)

/** \brief 59C, Receive Data View Register 18 */
#define SENT_CH18_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000359Cu)
/** Alias (User Manual Name) for SENT_CH18_VIEW.
* To use register names with standard convension, please use SENT_CH18_VIEW.
*/
#define SENT_VIEW18 (SENT_CH18_VIEW)

/** \brief 5A0, Interrupt Status Register 18 */
#define SENT_CH18_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00035A0u)
/** Alias (User Manual Name) for SENT_CH18_INTSTAT.
* To use register names with standard convension, please use SENT_CH18_INTSTAT.
*/
#define SENT_INTSTAT18 (SENT_CH18_INTSTAT)

/** \brief 5A4, Interrupt Set Register 18 */
#define SENT_CH18_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00035A4u)
/** Alias (User Manual Name) for SENT_CH18_INTSET.
* To use register names with standard convension, please use SENT_CH18_INTSET.
*/
#define SENT_INTSET18 (SENT_CH18_INTSET)

/** \brief 5A8, Interrupt Clear Register 18 */
#define SENT_CH18_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00035A8u)
/** Alias (User Manual Name) for SENT_CH18_INTCLR.
* To use register names with standard convension, please use SENT_CH18_INTCLR.
*/
#define SENT_INTCLR18 (SENT_CH18_INTCLR)

/** \brief 5AC, Interrupt Enable Register 18 */
#define SENT_CH18_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00035ACu)
/** Alias (User Manual Name) for SENT_CH18_INTEN.
* To use register names with standard convension, please use SENT_CH18_INTEN.
*/
#define SENT_INTEN18 (SENT_CH18_INTEN)

