Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSent_reg.h
/** \brief 610, Serial Data and Status Register 20 */
#define SENT_CH20_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003610u)
/** Alias (User Manual Name) for SENT_CH20_SDS.
* To use register names with standard convension, please use SENT_CH20_SDS.
*/
#define SENT_SDS20 (SENT_CH20_SDS)

/** \brief 614, Input and Output Control Register 20 */
#define SENT_CH20_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003614u)
/** Alias (User Manual Name) for SENT_CH20_IOCR.
* To use register names with standard convension, please use SENT_CH20_IOCR.
*/
#define SENT_IOCR20 (SENT_CH20_IOCR)

/** \brief 618, SPC Control Register 20 */
#define SENT_CH20_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003618u)
/** Alias (User Manual Name) for SENT_CH20_SCR.
* To use register names with standard convension, please use SENT_CH20_SCR.
*/
#define SENT_SCR20 (SENT_CH20_SCR)

/** \brief 61C, Receive Data View Register 20 */
#define SENT_CH20_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000361Cu)
/** Alias (User Manual Name) for SENT_CH20_VIEW.
* To use register names with standard convension, please use SENT_CH20_VIEW.
*/
#define SENT_VIEW20 (SENT_CH20_VIEW)

/** \brief 620, Interrupt Status Register 20 */
#define SENT_CH20_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003620u)
/** Alias (User Manual Name) for SENT_CH20_INTSTAT.
* To use register names with standard convension, please use SENT_CH20_INTSTAT.
*/
#define SENT_INTSTAT20 (SENT_CH20_INTSTAT)

/** \brief 624, Interrupt Set Register 20 */
#define SENT_CH20_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003624u)
/** Alias (User Manual Name) for SENT_CH20_INTSET.
* To use register names with standard convension, please use SENT_CH20_INTSET.
*/
#define SENT_INTSET20 (SENT_CH20_INTSET)

/** \brief 628, Interrupt Clear Register 20 */
#define SENT_CH20_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003628u)
/** Alias (User Manual Name) for SENT_CH20_INTCLR.
* To use register names with standard convension, please use SENT_CH20_INTCLR.
*/
#define SENT_INTCLR20 (SENT_CH20_INTCLR)

/** \brief 62C, Interrupt Enable Register 20 */
#define SENT_CH20_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000362Cu)
/** Alias (User Manual Name) for SENT_CH20_INTEN.
* To use register names with standard convension, please use SENT_CH20_INTEN.
*/
#define SENT_INTEN20 (SENT_CH20_INTEN)

/** \brief 630, Interrupt Node Pointer Register 20 */
#define SENT_CH20_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003630u)
/** Alias (User Manual Name) for SENT_CH20_INP.
* To use register names with standard convension, please use SENT_CH20_INP.
*/
#define SENT_INP20 (SENT_CH20_INP)

/** \brief 634, Watch Dog Timer Register 20 */
#define SENT_CH20_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003634u)
/** Alias (User Manual Name) for SENT_CH20_WDT.
* To use register names with standard convension, please use SENT_CH20_WDT.
*/
#define SENT_WDT20 (SENT_CH20_WDT)

/** \brief 640, Channel Pre Divider Register 21 */
#define SENT_CH21_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003640u)
/** Alias (User Manual Name) for SENT_CH21_CPDR.
* To use register names with standard convension, please use SENT_CH21_CPDR.
*/
#define SENT_CPDR21 (SENT_CH21_CPDR)

/** \brief 644, Channel Fractional Divider Register 21 */
#define SENT_CH21_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003644u)
/** Alias (User Manual Name) for SENT_CH21_CFDR.
* To use register names with standard convension, please use SENT_CH21_CFDR.
*/
#define SENT_CFDR21 (SENT_CH21_CFDR)

/** \brief 648, Receiver Control Register 21 */
#define SENT_CH21_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003648u)
/** Alias (User Manual Name) for SENT_CH21_RCR.
* To use register names with standard convension, please use SENT_CH21_RCR.
*/
#define SENT_RCR21 (SENT_CH21_RCR)

/** \brief 64C, Receive Status Register 21 */
#define SENT_CH21_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000364Cu)
/** Alias (User Manual Name) for SENT_CH21_RSR.
* To use register names with standard convension, please use SENT_CH21_RSR.
*/
#define SENT_RSR21 (SENT_CH21_RSR)

/** \brief 650, Serial Data and Status Register 21 */
#define SENT_CH21_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003650u)
/** Alias (User Manual Name) for SENT_CH21_SDS.
* To use register names with standard convension, please use SENT_CH21_SDS.
*/
#define SENT_SDS21 (SENT_CH21_SDS)

/** \brief 654, Input and Output Control Register 21 */
#define SENT_CH21_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003654u)
/** Alias (User Manual Name) for SENT_CH21_IOCR.
* To use register names with standard convension, please use SENT_CH21_IOCR.
*/
#define SENT_IOCR21 (SENT_CH21_IOCR)

/** \brief 658, SPC Control Register 21 */
#define SENT_CH21_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003658u)
/** Alias (User Manual Name) for SENT_CH21_SCR.
* To use register names with standard convension, please use SENT_CH21_SCR.
*/
#define SENT_SCR21 (SENT_CH21_SCR)

/** \brief 65C, Receive Data View Register 21 */
#define SENT_CH21_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000365Cu)
/** Alias (User Manual Name) for SENT_CH21_VIEW.
* To use register names with standard convension, please use SENT_CH21_VIEW.
*/
#define SENT_VIEW21 (SENT_CH21_VIEW)

/** \brief 660, Interrupt Status Register 21 */
#define SENT_CH21_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003660u)
/** Alias (User Manual Name) for SENT_CH21_INTSTAT.
* To use register names with standard convension, please use SENT_CH21_INTSTAT.
*/
#define SENT_INTSTAT21 (SENT_CH21_INTSTAT)

/** \brief 664, Interrupt Set Register 21 */
#define SENT_CH21_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003664u)
/** Alias (User Manual Name) for SENT_CH21_INTSET.
* To use register names with standard convension, please use SENT_CH21_INTSET.
*/
#define SENT_INTSET21 (SENT_CH21_INTSET)

/** \brief 668, Interrupt Clear Register 21 */
#define SENT_CH21_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003668u)
/** Alias (User Manual Name) for SENT_CH21_INTCLR.
* To use register names with standard convension, please use SENT_CH21_INTCLR.
*/
#define SENT_INTCLR21 (SENT_CH21_INTCLR)

