Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSent_reg.h
/** \brief 728, Interrupt Clear Register 24 */
#define SENT_CH24_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003728u)
/** Alias (User Manual Name) for SENT_CH24_INTCLR.
* To use register names with standard convension, please use SENT_CH24_INTCLR.
*/
#define SENT_INTCLR24 (SENT_CH24_INTCLR)

/** \brief 72C, Interrupt Enable Register 24 */
#define SENT_CH24_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000372Cu)
/** Alias (User Manual Name) for SENT_CH24_INTEN.
* To use register names with standard convension, please use SENT_CH24_INTEN.
*/
#define SENT_INTEN24 (SENT_CH24_INTEN)

/** \brief 730, Interrupt Node Pointer Register 24 */
#define SENT_CH24_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003730u)
/** Alias (User Manual Name) for SENT_CH24_INP.
* To use register names with standard convension, please use SENT_CH24_INP.
*/
#define SENT_INP24 (SENT_CH24_INP)

/** \brief 734, Watch Dog Timer Register 24 */
#define SENT_CH24_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003734u)
/** Alias (User Manual Name) for SENT_CH24_WDT.
* To use register names with standard convension, please use SENT_CH24_WDT.
*/
#define SENT_WDT24 (SENT_CH24_WDT)

/** \brief A80, Receive Time Stamp Register 0 */
#define SENT_RTS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A80u)

/** \brief A84, Receive Time Stamp Register 1 */
#define SENT_RTS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A84u)

/** \brief A88, Receive Time Stamp Register 2 */
#define SENT_RTS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A88u)

/** \brief A8C, Receive Time Stamp Register 3 */
#define SENT_RTS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A8Cu)

/** \brief A90, Receive Time Stamp Register 4 */
#define SENT_RTS4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A90u)

/** \brief A94, Receive Time Stamp Register 5 */
#define SENT_RTS5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A94u)

/** \brief A98, Receive Time Stamp Register 6 */
#define SENT_RTS6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A98u)

/** \brief A9C, Receive Time Stamp Register 7 */
#define SENT_RTS7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A9Cu)

/** \brief AA0, Receive Time Stamp Register 8 */
#define SENT_RTS8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AA0u)

/** \brief AA4, Receive Time Stamp Register 9 */
#define SENT_RTS9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AA4u)

/** \brief AA8, Receive Time Stamp Register 10 */
#define SENT_RTS10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AA8u)

/** \brief AAC, Receive Time Stamp Register 11 */
#define SENT_RTS11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AACu)

/** \brief AB0, Receive Time Stamp Register 12 */
#define SENT_RTS12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AB0u)

/** \brief AB4, Receive Time Stamp Register 13 */
#define SENT_RTS13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AB4u)

/** \brief AB8, Receive Time Stamp Register 14 */
#define SENT_RTS14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AB8u)

/** \brief ABC, Receive Time Stamp Register 15 */
#define SENT_RTS15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003ABCu)

/** \brief AC0, Receive Time Stamp Register 16 */
#define SENT_RTS16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AC0u)

/** \brief AC4, Receive Time Stamp Register 17 */
#define SENT_RTS17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AC4u)

/** \brief AC8, Receive Time Stamp Register 18 */
#define SENT_RTS18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AC8u)

/** \brief ACC, Receive Time Stamp Register 19 */
#define SENT_RTS19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003ACCu)

/** \brief AD0, Receive Time Stamp Register 20 */
#define SENT_RTS20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AD0u)

/** \brief AD4, Receive Time Stamp Register 21 */
#define SENT_RTS21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AD4u)

/** \brief AD8, Receive Time Stamp Register 22 */
#define SENT_RTS22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AD8u)

/** \brief ADC, Receive Time Stamp Register 23 */
#define SENT_RTS23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003ADCu)

/** \brief AE0, Receive Time Stamp Register 24 */
#define SENT_RTS24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AE0u)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXSENT_REG_H */
